<x-app-layout>
    <x-slot name="header">
        <div class="w-100 text-center">
        <h2 class="">
            {{ __('تكوين التوقيع') }}
        </h2>
    </div>
    </x-slot>
    <div class="text-start ps-2">
        <p>يرجى تحميل توقيعك الممسوح ضوئيًا هنا. سيتم وضع هذا التوقيع على جميع طلباتك. لا يمكن تغيير التوقيع بعد تحميله وتأكيده.</p>
        <p>
            <b>متطلبات:</b>
            <ul>
                <li>يجب أن تحتوي صورة الملف فقط على توقيع مقدم الطلب بشكل واضح على خلفية بيضاء.</li>
                <li>ينبغي أن يكون الملف بصيغة JPG/PNG.</li>
                <li>يجب أن يكون حجم الملف من 30 كيلو بايت على الأقل إلى 1 ميجا بايت كحد أقصى</li>
            </ul>
        </p>
        <livewire:signature/>
    </div>
</x-app-layout>
